<template>
    <div>
        <!-- navbar -->
        <navbar :userBaseInfo="userBaseInfo" />
        <!-- banner -->
        <div class="main-wrapper">
            <div class="page-title">
                <div class="container">
                    <div class="title-holder">
                        <div class="title-text text-center">
                            <h1>校团委学生部门</h1>
                        </div>
                    </div>
                </div>
            </div>
        </div>
        <div style="margin-top: 50px"></div>
        <!-- container -->
        <div class="container">
            <div class="row">
                <div class="col-md-12 col-sm-12 text-center">
                    <a-tabs type="card">
                        <a-tab-pane tab="组织介绍" key="1" class="text-left">
                            <p>共青团湖南中医药大学委员会是中国共产党领导的先进青年的群众组织，是湖南中医药大学青年在实践中学习中国特色社会主义和共产主义的学校，是学校党的助手和后备军，是联系党和青年的桥梁和纽带，担负着服务学校发展建设、服务青年成长成才的工作任务。</p>
                            <p>一直以来，校团委在学校党委领导下和上级团组织的指导下开展工作。发扬共青团的光荣传统和优良作风，秉承“严谨治学、追求卓越”的办学理念和“博学善建、厚德大成”的校训，突出思想引领和成长服务两大任务，注重加强自身建设，积极创新工作方法，着力打造完善的第二课堂育人体系。</p>
                            <p>工作中，校团委紧紧围绕学校党政工作要点，坚持立德树人，深化思想引领。注重加强理想信念教育，夯实团的基层组织，打造校园文化品牌，服务青年成长成才。重点在思想政治引领、基层组织建设、校园文化建设、科技创新、社会实践、创新创业、志愿服务等方面开展工作，教育和引导广大团员青年积极培育和践行社会主义核心价值观。帮助青年铸就梦想，扬帆起航，努力开创湖南中医药大学团学工作的新局面。</p>
                            <p>面向未来，校团委将深高举习近平新时代中国特色社会主义思想伟大旗帜，深入学习贯彻党的十九大、中央党的群团工作会议、全国高校思想政治工作会议、团的十八大、共青团湖南省第十四次代表大会精神，在学校党委和上级团组织的领导下，坚持立德树人根本任务，用马克思主义中国化的理论成果武装青年，用中国特色社会主义共同理想凝聚青年，用扎实有效的工作服务青年。团结和带领全校团员青年不忘初心、砥砺前行，为建设国际知名、国内一流的建筑大学凝聚青春力量！为实现中华民族伟大复兴的中国梦而努力奋斗！</p>
                        </a-tab-pane>
                        <a-tab-pane tab="部门设置" key="2">
                            <a-tabs type="card">
                                <a-tab-pane tab="校团委办公室" key="1">
                                    <img src="~assets/img/organization_1.webp">
                                    <p>我们，是一个成立不久并且充满朝气与生命力的部门。可静可动，静可常坐办公室，完成各类文书工作，万事了然于胸，温文尔雅；动可穿梭各类活动会场挥洒汗水，张扬青春；来加入我们吧，我们，是校团委办公室！</p>
                                    <h3>部门简介</h3>
                                    <p>校团委办公室隶属于校团委，设有秘书长一名、副秘书长两名，一方面负责校团委相关工作，另一方面起着沟通各校级组织与校团委老师的桥梁作用。其旨在督促协调各校级组织之间的工作，保证其能正确而顺利的进行。</p>
                                    <h3>部门职能</h3>
                                    <ul>
                                        <li>各组织承办的团通字活动文件的汇总及修改，团委直接下发文件的拟定；</li>
                                        <li>校级组织通知下发、人员资料汇总；</li>
                                        <li>四大组织学生干部考核情况进行审查；</li>
                                        <li>学生干部的任命文件及聘书；</li>
                                        <li>五四评优等团委直接评定的证书打印；</li>
                                        <li>团委资料汇编、资料归档；</li>
                                        <li>团委直接参与的会议（未落实到组织）的会务工作；</li>
                                        <li>团代会及团委直属部门换届工作会务；</li>
                                        <li>重大活动发言稿；</li>
                                        <li>安排团委办公室值班 。</li>
                                    </ul>
                                </a-tab-pane>
                                <a-tab-pane tab="校团委组织部" key="2">
                                    <img src="~assets/img/organization_2.webp">
                                    <p>锵锵锵锵～在这个学长学姐猛如虎的季节里，湖中大校团委直属部门组织部招新啦！！！来到校团委，你会发现一个高大上的部门，一个颜值泛滥的团体，爱上他（她）们，始于气质，陷于气场，忠于气度。这儿有严肃帅气霸气侧漏的帅哥和美丽大方彬彬有礼的美女，我们带你工作带你学习带你飞……还等什么，小鲜肉们快快过来看一看瞧一瞧吧！找到你们是我们最伟大的成功，加入我们，开启一个精彩故事！</p>
                                    <h3>部门简介</h3>
                                    <p>校团委组织部是校团委直属部门之一，下设常务组和礼仪队。常务组主要负责团内日常工作、团内统计、团内考核、团费收缴、团员注册、团员评议、团关系转接、青年政治理论学习、主题团日活动、团的基层组织建设和团学干部培训等；礼仪队主要负责校内外大小活动的礼仪接待工作及组织部内的常务工作。</p>
                                    <h3>部门职能</h3>
                                    <ul>
                                        <li>负责团内日常工作、团内统计、团内考核、团费收缴、团员注册、团员评议、团关系转接、青年政治理论学习、主题团日活动、团的基层组织建设和团校培训；</li>
                                        <li>负责校级四大组织考核评优；</li>
                                        <li>负责联系、指导、管理二级学院组织部开展工作，负责二级学院年度考核；</li>
                                        <li>负责学校对内对外的各种大型活动礼仪工作（包括各种晚会、庆典活动、比赛、会议和各类仪式等)的迎宾、颁奖等工作。</li>
                                    </ul>
                                </a-tab-pane>
                                <a-tab-pane tab="校团委自律部" key="3">
                                    <img src="~assets/img/organization_3.webp">
                                    <p>你还在为即将开始的大学生活而感到迷茫吗？你又是否对即将到来的大学生活满怀憧憬呢？步入大学，意味着青春的号角已经吹响，你的生活即将展开新的一页。加入校团委自律部一定是你最好的选择!</p>
                                    <h3>部门简介</h3>
                                    <p>自律部是校团委下属的重要职能部门，由校团委老师直接管理，其日常工作分为考评、培训和督导三部分，主要职能为维持学生组织纪律，考评学生组织中的主要学生干部，将考评信息数据化，清晰化地呈现和记录，为评优、评先以及优秀学生干部的选拔提供依据和建议。我们的部门口号是：自律飞扬，气宇轩昂，持之以恒，共铸锦程！</p>
                                    <h3>部门职能</h3>
                                    <ul>
                                        <li>考评工作：主要负责湖南中医药大学学生委员会、大学生艺术团、学生社团联合会、大学生科学技术协会（以下简称四大组织）主席团，各部门或者队伍负责人的考评工作，并建立学生干部信息库；</li>
                                        <li>培训工作：与组织部一起规划团校培训课，旨在丰富学生干部的课余生活，提高其综合素质，开拓视野；</li>
                                        <li>督导队工作：负责各项大型活动会场秩序的维持工作，监督学生干部培训期间的学习进度和完成率以及负责意见箱的管理。</li>
                                    </ul>
                                </a-tab-pane>
                                <a-tab-pane tab="校团委宣传部（岐黄传媒工作室）" key="4">
                                    <img src="~assets/img/organization_4.webp">
                                    <p>嗨咯！everybody 欢迎来到我们校团委宣传部（岐黄传媒工作室）明日之星的招新现场 大家已进入最生动活泼的地界</p>
                                    <h3>部门简介</h3>
                                    <p>宣传部（岐黄传媒工作室），负责校团委综合宣传工作，日常工作为负责全校团学工作及校内外重大事件的宣传与推送，负责管理运营校团委官方微信公众号——团学小微（微信公众号：hnzyydxtxxw）、官方微博——湖南中医药大学团委团学小微、QQ空间以及校团委官方网站“旗帜在线”，加强学生组织思想作风建设，统筹协调四大学生组织宣传工作。</p>
                                    <h3>部门职能</h3>
                                    <img src="~assets/img/organization_5.webp">
                                </a-tab-pane>
                            </a-tabs>
                        </a-tab-pane>
                    </a-tabs>
                </div>
            </div>
        </div>

        <Footer />

    </div>
</template>

<script>
import qs from 'qs'
import Footer from '~/components/footer.vue'
import navbar from '~/components/navbar'
import { mapState } from 'vuex'

export default {
  components: {
      Footer,
      navbar
  },
  data() {
    return {
    }
  },
  async asyncData({ $axios }) {
    let userBaseInfo = null

    await $axios.get('getUserBaseInfo')
    .then((response) => {
        userBaseInfo = response.data
    })

    return {
        userBaseInfo: userBaseInfo,
    }
  },
  methods: {
  },
  computed: mapState({
      baseUrl: state => state.baseUrl
  })
}
</script>

<style scoped>
a {
    text-decoration: none;
}

li {
    list-style-type: none;
}

img {
    width: 100%
}
</style>
